Revit 2026 API

# UpdaterRegistryGetRegisteredUpdaterInfos(Document) Method

---

Returns information about all updaters applicable to the given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<UpdaterInfo> GetRegisteredUpdaterInfos(
	Document document
)
```
```vb
Public Shared Function GetRegisteredUpdaterInfos (
	document As Document
) As IList(Of UpdaterInfo)
```
```cpp
public:
static IList<UpdaterInfo^>^ GetRegisteredUpdaterInfos(
	Document^ document
)
```
```fsharp
static member GetRegisteredUpdaterInfos :
        document : Document -> IList<UpdaterInfo>
```

#### Parameters

document Document
     The document to which sought updaters are applicable to.

#### Return Value

IListUpdaterInfo List of UpdaterInfo structures

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The list of data includes information about all updaters explicitly registered for the document as well as information about all application-wide registered updaters (which are applicable to all documents).

#### Reference

UpdaterRegistry Class

GetRegisteredUpdaterInfos Overload

Autodesk.Revit.DB Namespace